run/results/cylinder_with_initial_perturbation/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (1.500000e-01 0.000000e+00 0.000000e+00) // 0
    (9.184851e-18 1.500000e-01 0.000000e+00) // 1
    (-1.500000e-01 1.836970e-17 0.000000e+00) // 2
    (-2.755455e-17 -1.500000e-01 0.000000e+00) // 3
    (9.750000e-02 0.000000e+00 0.000000e+00) // 4
    (5.970153e-18 9.750000e-02 0.000000e+00) // 5
    (-9.750000e-02 1.194031e-17 0.000000e+00) // 6
    (-1.791046e-17 -9.750000e-02 0.000000e+00) // 7
    (1.500000e-01 0.000000e+00 5.000000e-01) // 8
    (9.184851e-18 1.500000e-01 5.000000e-01) // 9
    (-1.500000e-01 1.836970e-17 5.000000e-01) // 10
    (-2.755455e-17 -1.500000e-01 5.000000e-01) // 11
    (9.750000e-02 0.000000e+00 5.000000e-01) // 12
    (5.970153e-18 9.750000e-02 5.000000e-01) // 13
    (-9.750000e-02 1.194031e-17 5.000000e-01) // 14
    (-1.791046e-17 -9.750000e-02 5.000000e-01) // 15
);

blocks
(
hex (0 1 5 4 8 9 13 12) porosity (10 10 50)  edgeGrading (1.000000 1.000000 1.000000 1.000000 5.000000 5.000000 5.000000 5.000000 1.000000 1.000000 1.000000 1.000000)
hex (1 2 6 5 9 10 14 13) porosity (10 10 50)  edgeGrading (1.000000 1.000000 1.000000 1.000000 5.000000 5.000000 5.000000 5.000000 1.000000 1.000000 1.000000 1.000000)
hex (2 3 7 6 10 11 15 14) porosity (10 10 50)  edgeGrading (1.000000 1.000000 1.000000 1.000000 5.000000 5.000000 5.000000 5.000000 1.000000 1.000000 1.000000 1.000000)
hex (3 0 4 7 11 8 12 15) porosity (10 10 50)  edgeGrading (1.000000 1.000000 1.000000 1.000000 5.000000 5.000000 5.000000 5.000000 1.000000 1.000000 1.000000 1.000000)
hex (4 5 6 7 12 13 14 15) porosity (10 10 50)  edgeGrading (1.000000 1.000000 1.000000 1.000000 1.000000 1.000000 1.000000 1.000000 1.000000 1.000000 1.000000 1.000000)
);

edges
(
arc 0 1 (1.060660e-01 1.060660e-01 0.000000e+00) 
arc 1 2 (-1.060660e-01 1.060660e-01 0.000000e+00) 
arc 2 3 (-1.060660e-01 -1.060660e-01 0.000000e+00) 
arc 3 0 (1.060660e-01 -1.060660e-01 0.000000e+00) 
arc 4 5 (5.621499e-02 5.621499e-02 0.000000e+00) 
arc 5 6 (-5.621499e-02 5.621499e-02 0.000000e+00) 
arc 6 7 (-5.621499e-02 -5.621499e-02 0.000000e+00) 
arc 7 4 (5.621499e-02 -5.621499e-02 0.000000e+00) 
arc 8 9 (1.060660e-01 1.060660e-01 5.000000e-01) 
arc 9 10 (-1.060660e-01 1.060660e-01 5.000000e-01) 
arc 10 11 (-1.060660e-01 -1.060660e-01 5.000000e-01) 
arc 11 8 (1.060660e-01 -1.060660e-01 5.000000e-01) 
arc 12 13 (5.621499e-02 5.621499e-02 5.000000e-01) 
arc 13 14 (-5.621499e-02 5.621499e-02 5.000000e-01) 
arc 14 15 (-5.621499e-02 -5.621499e-02 5.000000e-01) 
arc 15 12 (5.621499e-02 -5.621499e-02 5.000000e-01) 
);

boundary
(
   bottom
   {
       type patch;
       faces
       (
       (1 0 4 5)
       (2 1 5 6)
       (3 2 6 7)
       (0 3 7 4)
       (5 4 7 6)
       );
   }
   walls
   {
      type wall;
      faces
      (
      (0 1 9 8)
      (1 2 10 9)
      (2 3 11 10)
      (3 0 8 11)
      );
   }
   top
   {
      type patch;
      faces
      (
      (8 9 13 12)
      (9 10 14 13)
      (10 11 15 14)
      (11 8 12 15)
      (12 13 14 15)
      );
   }
);

mergePatchPairs
(
);

