run/results/cylinder_with_initial_perturbation/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


h       100;         //heat transfer coefficient (W/(m^2 K))
rp      0.005;       //particle radius (m)

// Fluid

rhof    1.2;        //fluid density (kg/m^3)
cpf     700;        //fluid specific heat capacity (J/(kg*K)
kf      0.06;       //fluid thermal conductivity (W/(m*K)

// Values based on linear regression

mu      0.000007914;
Tmu     0;
mu2     0.000036794;
Tmu2    800;

// Solid

rhos    4700;       //stone density (kg/m^3)
cps     900;       //stone specific heat capacity (J/(kg*K)
ks      0;          //stone phase effective thermal conductivity (W/(m*K)