run/results/cylinder_with_initial_perturbation/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue porosity 0.36
);

regions
(
    boxToCell
    {
        box (-100 -100 -100) (100 100 0.20);
        fieldValues
        (
            volScalarFieldValue Tf 310
            volScalarFieldValue Ts 310
        );
    }

    cylinderToCell
    {
        point1  (0 0 0.20);
        point2  (0 0 0.30);
        radius  0.05;
        fieldValues
        (
            volScalarFieldValue Tf 310
            volScalarFieldValue Ts 310
        );
    }
);

// ************************************************************************* //
