run/results/cylinder_with_initial_perturbation/Allrun-parallel
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication decomposePar
runParallel $(getApplication)
runApplication reconstructPar
postProcess -func sample

#------------------------------------------------------------------------------
